#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.aks-storage-sandbox: Refreshing state... [id=trb6quqgdjc4o2bgxfvszy3]
random_pet.kv: Refreshing state... [id=kv-tolerant-sawfly]
random_pet.aks: Refreshing state... [id=aks-beloved-wren]
random_string.tf-storage-name: Refreshing state... [id=tmccfvikzuankdqxpfg10ko]
azurerm_resource_group.rg-networking: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox]
azurerm_resource_group.rg-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg-keyvault: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-keyvault-sandbox]
azurerm_resource_group.rg-tf-state: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state]
data.azurerm_client_config.current: Read complete after 0s [id=2022-12-22 21:58:43.422129099 +0000 UTC]
azurerm_network_security_group.nsg-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
azurerm_public_ip.vip-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/publicIPAddresses/vip-bastion-sandbox]
azurerm_local_network_gateway.lng_home: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/localNetworkGateways/local-gateway-home-sandbox]
azurerm_virtual_network.vnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox]
azurerm_network_security_group.nsg-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/networkSecurityGroups/nsg-bastion-sandbox]
azurerm_public_ip.pip_vnetgw: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/publicIPAddresses/pip-vnetgw-sandbox]
azurerm_key_vault.kv-sandbox: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-keyvault-sandbox/providers/Microsoft.KeyVault/vaults/kv-tolerant-sawfly]
azurerm_storage_account.aks-storage-sandbox: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.Storage/storageAccounts/trb6quqgdjc4o2bgxfvszy3]
azurerm_storage_account.tf-storage: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state/providers/Microsoft.Storage/storageAccounts/tmccfvikzuankdqxpfg10ko]
azurerm_subnet.subnet-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/AzureBastionSubnet]
azurerm_subnet.subnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/DefaultSubnet]
azurerm_subnet.subnet-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/AKSSubnet]
azurerm_subnet.subnet-vnetgw: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/GatewaySubnet]
azurerm_virtual_network_gateway.vnetgw_default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworkGateways/vnetgw-sandbox]
azurerm_virtual_network_gateway_connection.vng_connection_home: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/connections/onprem]
azurerm_kubernetes_cluster.aks-lab: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren]
azurerm_storage_share.share-aks-sandbox: Refreshing state... [id=https://trb6quqgdjc4o2bgxfvszy3.file.core.windows.net/sandbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks-lab will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks-lab" {
      ~ api_server_authorized_ip_ranges     = [
          + "172.125.57.122",
          - "172.125.57.122/32",
        ]
        id                                  = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren"
        name                                = "aks-beloved-wren"
        tags                                = {
            "automation"  = "terraform"
            "environment" = "sandbox"
            "owneralias"  = "sladeedmonds"
        }
        # (22 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.name will be created
  + resource "azurerm_private_endpoint" "name" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-networking-sandbox"
      + subnet_id                = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/DefaultSubnet"

      + private_service_connection {
          + is_manual_connection = false
          + name                 = (known after apply)
          + private_ip_address   = (known after apply)
        }
    }

  # random_pet.private_endpoint will be created
  + resource "random_pet" "private_endpoint" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "pep"
      + separator = "-"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @sladeedmonds, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*